Revit 2027 API
Category.LineColor Property
The color of lines shown for elements of this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color LineColor { get; set; }
Public Property LineColor As Color
	Get
	Set
public:
property Color^ LineColor {
	Color^ get ();
	void set (Color^ value);
}
member LineColor : Color with get, set
Property Value
Color
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace